{"file_name": "List of Topics for MS Project and Thesis", "file_type": "txt", "content": "Prof. Paiella \n \n1.  Title of the project:  \nMetasurface photodetectors for all-optical image processing  \n2.  Required Student Backgrounds:  \nBasic knowledge of photonics \n3.  Expected period of the project (typically one semester for MS project and at least one semester \nfor MS Thesis):  \nOne semester OK, two preferred \n4.  Possibility of Extending to a Thesis: Yes \n5.  CV or some other specific information that you would like students with interest to send to you \nfor screening candidates:  CV \nDescription of the project: \nAll imaging systems, including standard digital cameras, rely on photodetectors to convert incident \nlight into electrical signals that are then processed to reconstruct an image.  We are investigating \nthe integration of these devices with arrays of metallic or dielectric nanoparticles (metasurfaces), \ndesigned so that only light incident along a prescribed set of directions can be detected.  The \nresulting angle-sensitive photodetectors may enable the development of cameras with \nunprecedented size miniaturization, record large fields of view, and capable of performing basic \nimage-processing functionalities (e.g., for contrast enhancement and edge detection) directly in the \noptical domain.  The project will involve full-wave electromagnetic simulations based on \ncommercially available software to design the required nanoparticle arrays. \n \nProf. Dal Negro \n \n1. \"Physics-driven machine learning for magneto-electric metamaterials design\" \nBackground: CE, EE \nExpected period: 1 year total with possible extension \nCandidates must send me a CV \n \n2. \"Intensity-based inverse scattering and lensless imaging with learning methods\" \nBackground: CE, EE \nExpected period: 1 year total with possible extension \nCandidates must send me a CV \n3. \"Engineering multifunctional diffractive optics in the quantum regime\" \nBackground: EE \nExpected period: 1 year total with possible extension \nCandidates must send me a CV \n4. \"Wave localization in number-theoretic landscapes\" \nBackground: EE, but also Math and Physics \nExpected period: 1 year total with possible extension \nCandidates must send me a CV \n5. \"Lattice-based cryptography on optical quasicrystals\" \nBackground: EE, but also Math and Physics \n \n \n \n \nExpected period: 1 year total with possible extension \nCandidates must send me a CV \n \nProf. Lei Tian \n1.  Title of the project: \nDevelopment of Gen-2 imaging acquisition platform of Computational Miniature \nMesoscope \n \nMore details can be found here: \nSingle-Shot 3D Widefield Fluorescence Imaging with a Computational Miniature Mesoscope \nYujia Xue, Ian G. Davison, David A. Boas, Lei Tian \nScience Advances 21 OCT 2020: EABB7508 \n– BU ENG news: Brain Imaging Scaled Down \n2.  Required Student Backgrounds (i.e CE, EE, any specific courses taken, etc): \nHands on experience and/or interest in developing circuit and 3D printing. \n3.  Expected period of the project (typically one semester for MS project and at least one \nsemester for MS Thesis) -- at least 1 semester \n4.  Possibility of Extending to a Thesis. --- depends on progress \n5.  CV or some other specific information that you would like students with interest to send to \nyou for screening candidates.  --- please send a CV. \n \n", "_id": "6058f43d3f9da5628cb17f8e"}